#########
# EXTRA #
#########

### Utilities
cask "transmission"
mas  "Mactracker", id: 430255202
cask "android-platform-tools"
brew "mobiledevice"

### File System & Co.
cask "openzfs"
brew "ntfs-3g"
cask "unetbootin"
cask "android-file-transfer"
cask "duck"
cask "cyberduck"
cask "disk-inventory-x"

### Compression
brew "lzo"
brew "lz4"
brew "gzip"
brew "unzip"

### Chat
cask "skype"
cask "adium"
cask "signal"
cask "slack"
cask "telegram"
cask "goofy"

### QuickLook
cask "qlcolorcode"
cask "qlstephen"
cask "qlmarkdown"

### Command line
brew "watch"
brew "terminal-notifier"
brew "sl"
brew "archey"
brew "ncdu"
brew "iftop"
brew "bmon"
brew "qrencode"
brew "lsof"
brew "cmatrix"
brew "cowsay"
brew "fortune"
brew "ranger"
brew "the_silver_searcher"

### Network
brew "netcat6"
brew "ntopng"
brew "rtorrent" #(needs gcc)
brew "ipfs"
brew "iperf3"
brew "iperf"
brew "httpie"
cask "wireshark"


##########
# CRYPTO #
##########

### Crypto
brew "scrypt"
brew "bcrypt"
brew "gnutls"
brew "ssh-vault"
brew "ssh-copy-id"
cask "cryptomator"
brew "pwgen"
brew "gpgme"


#######
# DEV #
#######

mas  "XCode", id: 497799835

### Design
mas  "Affinity Designer", id: 824171161

### Virtualization
cask "virtualbox"
cask "vagrant"
cask "docker"
cask "kitematic"

### From Homebrew
brew "git-extras"
brew "git-flow"
brew "cmake"
brew "icdiff"
brew "gcc"
brew "gdb"
brew "scala"
brew "sloccount"
brew "heroku"
brew "shellcheck"

### From Caskroom
cask "gitup"
cask "sublime-text"
cask "oni"
cask "now"
cask "staruml"
cask "chromium"
cask "java"
cask "hyper"


############
# EMBEDDED #
############

### Tools for basic embedded development
#cask "arduino"
#cask "kicad"


#########
# FONTS #
#########
cask "font-hack"
cask "font-interface"
cask "font-ibm-plex"
cask "font-fira-code"
cask "font-computer-modern"
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"


##########
# GAMING #
##########
cask "powder"
cask "steam"
cask "gog-galaxy"


#########
# MEDIA #
#########
mas  "iMovie", id:408981434
brew "ffmpeg"
brew "graphicsmagick"
brew "webp"
brew "imagemagick"
cask "mpv"
cask "imageoptim"
brew "mkvtoolnix"
brew "media-info"
brew "flif"
brew "exiftool"
cask "plexamp"
cask "plex-media-player"
cask "handbrake"
cask "handbrake-cli"


#################
# Writing & Co. #
#################
cask "wkhtmltopdf"
cask "basictex"


###########
# PRIVACY #
###########
brew "tor"
brew "torsocks"
cask "torbrowser"
cask "tunnelblick"
